<template>
  <div>
    <p>
      Hello, my name is Pinpong Tongpat (Pin). <br />
      I am full stack web developer.
    </p>
    <nuxt-img preload src="/profile.jpg" />

    <p>
      สวัสดีผมเป็น dev เดปไม่ได้หมายถึงคนเขียนโปรแกรม แต่หมายถึงนักพัฒนา
      และความหมายของผมต่างไปจากนั้นอีก นักพัฒนาที่ไม่ได้พัฒนาแค่ผลงาน
      แต่ยังหมายถึงพัฒนาตัวเอง อย่างสม่ำเสมอ เดปไม่เคยหยุดและหยุดไม่ได้
    </p>
    <p>
      เว็บไซต์นี้เป็นพื้นที่สำหรับเรียนรู้
      ส่วนใหญ่ก็คงเป็นตัวผมเองที่ได้เรียนรู้ก่อนที่จะเอามาบันทึกที่นี่
      บันทึกไว้เพื่อให้ตัวเองได้มาอ่านในอนาคตเผื่อจะลืมไป
      กลับมาอ่านความคิดของเด็กคนนึงว่าคิดอะไรยังไงในช่วงเวลานั้นๆ
    </p>
    <p>
      ปฏิเสธไม่ได้นะว่าเราไม่มีทางจำอะไรได้หมดอยู่แล้วถึงแม้จะทำมันบ่อยๆก็ตาม
      และหากเราไม่ต้องเครียดว่าจะจำหมดไหม
      ไว้ค่อยกลับมาอ่านเดี้ยวก็นึกขึ้นได้เองก็คงจะเบาสมองไม่น้อย
    </p>
    <p>
      เรื่องราวหลายเรื่องที่จะบันทึกมีทั้งแนวคิด วิธีคิด วิธีทำ และเทคนิคต่างๆ
      ไว้จะมาบันทึกไว้บ่อยๆนะครับ
    </p>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  name: 'IndexPage',
})
</script>
