function HomePage() {
    return (
        <>
            {/* <h3>Home</h3> */}
            <p>
                Hello, my name is Pinpong Tongpat (Pin). <br /> I am full stack web
                developer.
            </p>

            <img src={require('../../assets/profile.jpg')} />

            <p>
                สวัสดี ผมเป็น dev ครับ dev ที่หมายถึงนักพัฒนา พัฒนาทั้งผลงานเพื่อตอบโจทย์ที่ลูกค้าต้องการ และพัฒนาตัวเองเพื่อตัวเอง 
                ผมเชื่อว่าสกิลที่สำคัญที่สุดคือสกิลด้านการเรียนรู้ การปรับตัว และการพัฒนาตัวเอง
                แต่ก่อนการจะเป็นโปรแกรมเมอร์นั้นต้องเป็นคนที่มีความรู้มาก แต่สมัยนี้วิชาการเขียนโปรแกรมมีอยู่ในบทเรียนประถมแล้ว 
                นั้นแปลว่าทุกคนเขียนโปรแกรมได้ ใครๆก็เป็นโปรแกรมเมอร์ได้ สกิลการปรับตัว และเรียนรู้จึงสำคัญมากขึ้น
                ผมจึงเลือกที่จะเป็น dev แล้วใช้สกิลเหล่านั้นที่ผมมี
                <br />
                <br />

                ผมพัฒนาเว็บไซต์ หน้าบ้านและหลังบ้าน พัฒนาระบบต่างๆ พัฒนาโมบายแอพลิเคชัน รวมถึงงานออกแบบ ออกแบบเว็บไซต์
                ออกแบบโปสเตอร์ งานตัดต่อวิดีโอ และอื่นๆ <br />
                นั้นทำให้ผมเป็นเป็ด เป็ดนั้นไม่ได้ต่ำต่อยนะ เป็ดนั้นอาจจะบินได้เก่งกว่านกบางชนิดเสียอีก อาจจะว่ายน้ำได้เก่งกว่าปลาบางชนิดเช่นกัน
                เป็ดนั้นก็มีข้อดีของมัน ผมเคยสับสนนิดเรื่องการเป็นเป็ด เพราะแต่ก่อนก็ยึดถือในเรื่องนี้ ผมได้อ่านบทความนึง เป็นเรื่องของ อีลอนมัส
                อีลอนมัส ไม่เลือกคนแบบเป็ดเข้าทำงานเพราะเขาอยากได้ ผู้เชี่ยวชานด้านนั้นจริงๆ ถ้าเขาจะทำเรื่องอื่นเดี๋ยวเขาไปจ้างคนอื่นมาทำดีกว่า
                บทความนี้ทำผมนั่งคิดนอนคิดอยู่พักใหญ่ แล้วก็กลับมาเป็นเป็ดแบบเดิม เพราะผมคิดจนรู้สึกเคลียดเกินไป ผมก็แค่ใช้ชีวิตแบบเดิมไป
                ถ้าผมว่ายน้ำทุกวัน ยังไงผมก็ต้องว่ายน้ำเก่งขึ้น แต่ผมก็จะฝึกบินไปด้วย ฝึกเดินฝึกวิ่งไปด้วย แค่มีความสุขกับมัน
                
            </p>

            <p></p>
        </>
    )
}

export default HomePage
