function HomePage() {
  return (
    <>
      {/* <h3>Home</h3> */}
      <p>
        Hello, my name is Pinpong Tongpat (Pin). <br /> I am full stack web developer.
      </p>

      <img src={require('../../assets/profile.jpg')} alt="pinpong.co" />

      <p>
        สวัสดีผมเป็น dev เดปไม่ได้หมายถึงคนเขียนโปรแกรม แต่หมายถึงนักพัฒนา และความหมายของผมต่างไปจากนั้นอีก
        นักพัฒนาที่ไม่ได้พัฒนาแค่ผลงาน แต่ยังหมายถึงพัฒนาตัวเอง อย่างสม่ำเสมอ เดปไม่เคยหยุดและหยุดไม่ได้
      </p>
      <p>
        เว็บไซต์นี้เป็นพื้นที่สำหรับเรียนรู้ ส่วนใหญ่ก็คงเป็นตัวผมเองที่ได้เรียนรู้ก่อนที่จะเอามาบันทึกที่นี่
        บันทึกไว้เพื่อให้ตัวเองได้มาอ่านในอนาคตเผื่อจะลืมไป กลับมาอ่านความคิดของเด็กคนนึงว่าคิดอะไรยังไงในช่วงเวลานั้นๆ
      </p>
      <p>
        ปฏิเสธไม่ได้นะว่าเราไม่มีทางจำอะไรได้หมดอยู่แล้วถึงแม้จะทำมันบ่อยๆก็ตาม และหากเราไม่ต้องเครียดว่าจะจำหมดไหม
        ไว้ค่อยกลับมาอ่านเดี้ยวก็นึกขึ้นได้เองก็คงจะเบาสมองไม่น้อย
      </p>
      <p>เรื่องราวหลายเรื่องที่จะบันทึกมีทั้งแนวคิด วิธีคิด วิธีทำ และเทคนิคต่างๆ ไว้จะมาบันทึกไว้บ่อยๆนะครับ</p>
      <p>test update</p>
      {/*
          สวัสดี ผมเป็น dev ครับ dev ที่หมายถึงนักพัฒนา พัฒนาทั้งผลงานเพื่อตอบโจทย์ที่ลูกค้าต้องการ
          และพัฒนาตัวเองเพื่อตัวเอง ผมเชื่อว่าสกิลที่สำคัญที่สุดคือสกิลด้านการเรียนรู้ การปรับตัว และการพัฒนาตัวเอง
          แต่ก่อนการจะเป็นโปรแกรมเมอร์นั้นต้องเป็นคนที่มีความรู้มาก แต่สมัยนี้วิชาการเขียนโปรแกรมมีอยู่ในบทเรียนประถมแล้ว
          นั้นแปลว่าทุกคนเขียนโปรแกรมได้ ใครๆก็เป็นโปรแกรมเมอร์ได้ สกิลการปรับตัว และเรียนรู้จึงสำคัญมากขึ้น
          ผมจึงเลือกที่จะเป็น dev แล้วใช้สกิลเหล่านั้นที่ผมมี
          */}
      {/* ผมพัฒนาเว็บไซต์ หน้าบ้านและหลังบ้าน พัฒนาระบบต่างๆ พัฒนาโมบายแอพลิเคชัน รวมถึงงานออกแบบ ออกแบบเว็บไซต์
                ออกแบบโปสเตอร์ งานตัดต่อวิดีโอ และอื่นๆ <br />
                นั้นทำให้ผมเป็นเป็ด เป็ดนั้นไม่ได้ต่ำต่อยนะ เป็ดนั้นอาจจะบินได้เก่งกว่านกบางชนิดเสียอีก อาจจะว่ายน้ำได้เก่งกว่าปลาบางชนิดเช่นกัน
                เป็ดนั้นก็มีข้อดีของมัน ผมเคยสับสนนิดเรื่องการเป็นเป็ด เพราะแต่ก่อนก็ยึดถือในเรื่องนี้ ผมได้อ่านบทความนึง เป็นเรื่องของ อีลอนมัส
                อีลอนมัส ไม่เลือกคนแบบเป็ดเข้าทำงานเพราะเขาอยากได้ ผู้เชี่ยวชานด้านนั้นจริงๆ ถ้าเขาจะทำเรื่องอื่นเดี๋ยวเขาไปจ้างคนอื่นมาทำดีกว่า
                บทความนี้ทำผมนั่งคิดนอนคิดอยู่พักใหญ่ แล้วก็กลับมาเป็นเป็ดแบบเดิม เพราะผมคิดจนรู้สึกเคลียดเกินไป ผมก็แค่ใช้ชีวิตแบบเดิมไป
                ถ้าผมว่ายน้ำทุกวัน ยังไงผมก็ต้องว่ายน้ำเก่งขึ้น แต่ผมก็จะฝึกบินไปด้วย ฝึกเดินฝึกวิ่งไปด้วย แค่มีความสุขกับมัน */}
      <p></p>
    </>
  );
}

export default HomePage;
